tests/qa-a-add_perf.yml
config:
  target: "http://localhost:3000"
  phases:
    - name: Warm up
      duration: 10
      arrivalRate: 10
    - name: Ramp up 1
      duration: 5
      arrivalRate: 10
      rampTo: 100
    - name: Ramp up 2
      duration: 5
      arrivalRate: 100
      rampTo: 1000
    - name: Load test
      duration: 10
      arrivalRate: 1000

scenarios:
  - name: "Add a new answer"
    flow:
      - post:
          url: "/qa/a/add"
          json:
            question: "{ body: 'body', name: 'name', email: 'email', question_id: 50 }"